Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings.IsEqual(Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings)
Compares two colored surface settings objects.
other:
Colored surface settings object to compare with.
Returns:
True if objects are equal, false otherwise.
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings.Transparency
Transparency percentage of colored surface
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
When setting this property: transparency is less than 0 or greater than 100
Since:
2019

Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings.GridLineWeight
Line weight of grid lines.
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings.GridColor
Color of grid lines.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings.ShowContourLines
If true, show contour lines in the analysis display.
Since:
2013

Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings.ShowGridLines
If true, show grid lines in the analysis display.
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings.#ctor
Constructs a default instance of colored surface settings.
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings.#ctor(Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings)
Constructs a new copy of the input AnalysisDisplayColoredSurfaceSettings object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings
Contains colored surface settings for analysis display style element.
Since:
2011